/// 操舵の完成版(ver.0.1.0)
/****************************************************
 * マクロ部
 ****************************************************/
#include <string.h>
#include <MsTimer2.h>
#include <EEPROM.h>

//ピン設定
#define PIN_X 0
#define PIN_Y 1
#define PIN_SW 10

//サーボの設定
#define MAX_ANGLE_ADDRESS 0    //EEPROMにおけるmax_angleのアドレス
/****************************************************
 * 構造体宣言部
 ****************************************************/

/****************************************************
 * プロトタイプ宣言部
 ****************************************************/
//---sub_file内で定義---------------------------------

//---------------------------------------------------

/****************************************************
 * グローバル変数/配列 宣言部
 ****************************************************/
//ピン設定
const int EnPin = 2;    //送受信切替

int posData;

//---EEPROMに保存しているもの---------------------------
//サーボの片方向への最大動作角度
int max_angle;


/****************************************************
 * Arduino 要求関数部
 ****************************************************/
void setup() {
    //サーボ用初期設定
    Serial.begin(115200, SERIAL_8E1);   //UARTの通信設定
    pinMode(PIN_SW, INPUT_PULLUP);
    pinMode(EnPin, OUTPUT);             //送受信切替ピンの設定
    digitalWrite(EnPin, LOW);           //常に受信モードにしておく

    //EEPROMの初期設定
    max_angle = EEPROM.read(MAX_ANGLE_ADDRESS);
}

void loop() {
    for(int i = 0; i < 8000; i++) {
      posData = ics_set_pos(0, i + 3500);
      delayMicroseconds(5);
    }
    for(int i = 8000; i > 0; i--) {
      posData = ics_set_pos(0, i + 3500);
      delayMicroseconds(5);
    }
}

/****************************************************
 * 独自関数部
 ****************************************************/
